#+BLOG: noise on the net
#+POSTID: 376
#+ORG2BLOG:
#+DATE: [2024-03-25 lun 21:48]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: Language learning
#+TAGS: Rust
#+DESCRIPTION: An introduction to coroutines, typestate machine, phantom types, iterators and ownership issues
#+TITLE: Prime Time

In this post I will create a prime number iterator to demonstrate how to emulate
a coroutine in Rust using a 'Typestate' finite state machine.

This exercise will also show how to use phantom types and ownership to guarantee
proper function call and how to use ~take~ to consume a value behind a mutable
reference.

This is a second digression from the tree posts I started, but will prove useful
with them.

previous posts were
- first
- second
- third

* A Prime example in Python
In order to show the algorithm we are using as an example I will write it in
Python first

#+begin_src python :exports both :results output
def prime_coroutine():
    # first we create a list of prime numbers discovered so far
    primes = []
    # let's start with 2
    current = 2
    # loop forever
    while True:
        # check if the current number is prime
        found = True
        for prime in primes:
            # we wish to check all primes which are
            # smaller than the sqrt(current)
            if prime * prime > current:
                break
            # check primality
            if current % prime == 0:
                found = False
                break
        if found:
            primes.append(current)
            # this does the magic
            yield current
        # let's go with the next
        current += 1

# create the coroutine object
coroutine = prime_coroutine()

# each call will restart from the latest yield
print(next(coroutine))
print(next(coroutine))
print(next(coroutine))
#+end_src

#+RESULTS:
: 2
: 3
: 5

